---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailingHeightCorrectionOption.Custom
enum: Autodesk.Revit.DB.Architecture.RailingHeightCorrectionOption
source: html/d9416587-7a7d-3785-b6db-7e4004aeadb3.htm
---
# Autodesk.Revit.DB.Architecture.RailingHeightCorrectionOption.Custom

User needs to define the height value of the railing.